#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

google_compute_network.peering_network: Refreshing state... [id=projects/gh-bot-386308/global/networks/private-network]
google_storage_bucket.gcs_bucket: Refreshing state... [id=gh-bot-tfstate]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/gh-bot-386308/global/addresses/private-ip-address]
google_service_networking_connection.default: Refreshing state... [id=projects%2Fgh-bot-386308%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com]
google_sql_database_instance.instance: Refreshing state... [id=terraform-20230511121344450000000001]
google_sql_database.postgres: Refreshing state... [id=projects/gh-bot-386308/instances/terraform-20230511121344450000000001/databases/github-releases-bot]
google_sql_user.database-user: Refreshing state... [id=github-bot//terraform-20230511121344450000000001]
google_cloud_run_service.run: Refreshing state... [id=locations/us-central1/namespaces/gh-bot-386308/services/gh-bot]
google_cloud_run_service_iam_member.member: Refreshing state... [id=v1/projects/gh-bot-386308/locations/us-central1/services/gh-bot/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.run will be updated in-place
  ~ resource "google_cloud_run_service" "run" {
        id                         = "locations/us-central1/namespaces/gh-bot-386308/services/gh-bot"
        name                       = "gh-bot"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ metadata {
              ~ annotations = {
                  - "autoscaling.knative.dev/maxScale"      = "100"
                  - "autoscaling.knative.dev/minScale"      = "1"
                  - "run.googleapis.com/client-name"        = "cloud-console"
                  - "run.googleapis.com/cloudsql-instances" = "gh-bot-386308:europe-central2:terraform-20230511121344450000000001"
                } -> (known after apply)
                # (2 unchanged attributes hidden)
            }
          ~ spec {
              ~ service_account_name  = (sensitive value)
                # (2 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "s3kkt/github-releases-bot:release" -> "=s3kkt/github-releases-bot:6a66c96"
                    # (2 unchanged attributes hidden)

                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }

                    # (7 unchanged blocks hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_sql_database.postgres must be replaced
-/+ resource "google_sql_database" "postgres" {
      ~ charset         = "UTF8" -> (known after apply)
      ~ collation       = "en_US.UTF8" -> (known after apply)
      ~ id              = "projects/gh-bot-386308/instances/terraform-20230511121344450000000001/databases/github-releases-bot" -> (known after apply)
      ~ instance        = "terraform-20230511121344450000000001" # forces replacement -> (known after apply) # forces replacement
      ~ name            = "github-releases-bot" -> "=github-releases-bot" # forces replacement
      ~ project         = "gh-bot-386308" -> (known after apply)
      ~ self_link       = "https://sqladmin.googleapis.com/sql/v1beta4/projects/gh-bot-386308/instances/terraform-20230511121344450000000001/databases/github-releases-bot" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_sql_database_instance.instance must be replaced
-/+ resource "google_sql_database_instance" "instance" {
      ~ available_maintenance_versions = [
          - "POSTGRES_14_5.R20230316.02_05",
        ] -> (known after apply)
      ~ connection_name                = "gh-bot-386308:europe-central2:terraform-20230511121344450000000001" -> (known after apply)
      + encryption_key_name            = (known after apply)
      ~ first_ip_address               = "34.118.122.35" -> (known after apply)
      ~ id                             = "terraform-20230511121344450000000001" -> (known after apply)
      ~ instance_type                  = "CLOUD_SQL_INSTANCE" -> (known after apply)
      ~ ip_address                     = [
          - {
              - ip_address     = "34.118.122.35"
              - time_to_retire = ""
              - type           = "PRIMARY"
            },
          - {
              - ip_address     = "34.116.202.130"
              - time_to_retire = ""
              - type           = "OUTGOING"
            },
          - {
              - ip_address     = "10.151.0.3"
              - time_to_retire = ""
              - type           = "PRIVATE"
            },
        ] -> (known after apply)
      ~ maintenance_version            = "POSTGRES_14_5.R20230316.02_02" -> (known after apply)
      + master_instance_name           = (known after apply)
      ~ name                           = "terraform-20230511121344450000000001" -> (known after apply)
      ~ private_ip_address             = "10.151.0.3" -> (known after apply)
      ~ project                        = "gh-bot-386308" -> (known after apply)
      ~ public_ip_address              = "34.118.122.35" -> (known after apply)
      ~ region                         = "europe-central2" -> "=europe-central2" # forces replacement
      ~ self_link                      = "https://sqladmin.googleapis.com/sql/v1beta4/projects/gh-bot-386308/instances/terraform-20230511121344450000000001" -> (known after apply)
      ~ server_ca_cert                 = [
          - {
              - cert             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyRiNmFh
                    ZTAxMC05NzAxLTQyODAtODQ1Yi1hNzc3MzczZjY1OTgxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjMwNTExMTIxMzUyWhcNMzMwNTA4MTIxNDUyWjB3MS0wKwYD
                    VQQuEyRiNmFhZTAxMC05NzAxLTQyODAtODQ1Yi1hNzc3MzczZjY1OTgxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQC3yKgLe4eaW0aGPcimff76EXGwdwUDqg97I7HvWWKOuGeAVuJHKexYMTzcdmQC
                    UAUyun6G/Lkxqbw8ljIcAnH8XYG7sUqRNmYyg77D29AjdyYBadNYwc1eTMBFW/Wb
                    FVT7fhhXU+EU0BpIgxBxj92NL6duit6t15x4bVKjsr4GUP4dZvb8UoRaZa0fakIl
                    Y1x9FMRdddpqXwRH616t8AZatQ2BAcXWMI27W+eyhGEq3RDmBs1wwlWIXbRM4XS7
                    hNoI8lnqvHJJKoTeTFJpXQdbw5CnSlJJvO2m2lHK5ZNarLQOLf1XQnbFaRWu4cMS
                    bU24Wj6iUwtgfcsbCwogmN4dAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAFA3OAeCwc1xV8sXW/+S7irQimmW7KHfKPpiGKPZ
                    ksERKvhOCqR872zNdJl1neSyFyqlqviuqJhfHFh7I7t8/bVfz7wXu3mo2No+19IQ
                    geapWuJKp8qn2MhpaCyc3ld8XWmVM8z5mHhsCsYh2PUJqG2rZ12iW119GzvfjakK
                    uMBatDlqdlSq6X6sJZD0DIJpP4EVfCGgBZYaMY10hVNz8plnLgltnQ/5JLz9g7O6
                    +5qTcu4T5QiTh0a/dG2IMUvbgVZmBmVkIZ5CNi8SkzTkbEriwKi9pGlXPujKRFWj
                    nVo+mGgaMtECbgVN2lxHGyYqTKZkzgrJ9Rni5cbHL3aYBVA=
                    -----END CERTIFICATE-----
                EOT
              - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=b6aae010-9701-4280-845b-a777373f6598"
              - create_time      = "2023-05-11T12:13:52.325Z"
              - expiration_time  = "2033-05-08T12:14:52.325Z"
              - sha1_fingerprint = "0d7a7518d491f5491edff40019652e1b02319af2"
            },
        ] -> (known after apply)
      ~ service_account_email_address  = "p885824934487-psvx5z@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ settings {
          ~ connector_enforcement       = "NOT_REQUIRED" -> (known after apply)
          - deletion_protection_enabled = false -> null
          ~ user_labels                 = {} -> (known after apply)
          ~ version                     = 31 -> (known after apply)
            # (8 unchanged attributes hidden)

          - backup_configuration {
              - binary_log_enabled             = false -> null
              - enabled                        = false -> null
              - point_in_time_recovery_enabled = false -> null
              - start_time                     = "02:00" -> null
              - transaction_log_retention_days = 7 -> null

              - backup_retention_settings {
                  - retained_backups = 7 -> null
                  - retention_unit   = "COUNT" -> null
                }
            }

          ~ ip_configuration {
              - enable_private_path_for_google_cloud_services = false -> null
                # (3 unchanged attributes hidden)
            }

          - location_preference {
              - zone = "europe-central2-c" -> null
            }

            # (1 unchanged block hidden)
        }
    }

  # google_sql_user.database-user must be replaced
-/+ resource "google_sql_user" "database-user" {
      + host                    = (known after apply)
      ~ id                      = "github-bot//terraform-20230511121344450000000001" -> (known after apply)
      ~ instance                = "terraform-20230511121344450000000001" # forces replacement -> (known after apply) # forces replacement
      ~ name                    = "github-bot" -> "=github-bot" # forces replacement
      ~ password                = (sensitive value)
      ~ project                 = "gh-bot-386308" -> (known after apply)
      ~ sql_server_user_details = [] -> (known after apply)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ database_address = "gh-bot-386308:europe-central2:terraform-20230511121344450000000001" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @s3kkt, Action: `pull_request`*